Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: escape key
zh_cn: 退出键(ESC)

source: fields for last frames input.
zh_cn: 最后一帧输入的字段。

source: fog values
zh_cn: 雾值

source: full path and filename of the YYP project
zh_cn: YYP项目的完整路径和文件名

source: gain = (listener_distance / reference_distance) ^ (-falloff_factor)
zh_cn: 增益=(侦听器的距离/基准距离)^(-衰减系数) gain = (listener_distance / reference_distance) ^ (-falloff_factor)

source: gain = 1
zh_cn: 增益 = 1

source: gain = reference_distance / (reference_distance + falloff_factor * (listener_distance - reference_distance))
zh_cn: gain = 基准距离 / (基准距离 + 衰减系数 * (侦听器的距离 - 基准距离)) gain = reference_distance / (reference_distance + falloff_factor * (listener_distance - reference_distance))

source: gravity is one of the "built in" variables all instances have and, when set, will apply a constant force in the gravity_direction of the instance, influencing both the instance speed and direction.
zh_cn: Gravity是所有实例都具有的"内置"变量之一，设置后将在实例的gravity_direction上施加恒定的力，从而影响实例的速度和方向。

source: gravity_direction is one of the "built in" properties all instances have and can be used to set the direction of movement when the instances gravity is greater than 0.
zh_cn: Gravity_direction是所有实例都具有的"内置"属性之一，可用于在实例gravity大于0时设置移动方向。

source: his function can be used to display debug information about any given sync group (the group index is the value returned when the group was created using the function audio_create_sync_group()).
zh_cn: 此函数可用于显示任何给定同步组的调试信息(组索引是使用函数audio_create_sync_group()创建组时返回的值)。

source: his function returns whether a path with the given index exists or not.
zh_cn: 此函数返回给定索引的路径是否存在。

source: his function will pause the given sync group if it is playing, with the group index being the value returned when you created the group using the function audio_create_sync_group().
zh_cn: 如果给定的同步组正在播放，他的函数将暂停该同步组，组索引是使用函数audio_create_sync_group()创建组时返回的值。

source: home key
zh_cn: 主页键(home)

source: hspeed is one of the "built in" properties that all instances have and defines the horizontal movement speed (along the x-axis) of the instance in pixels per step.
zh_cn: Hspeed是所有实例都具有的"内置"属性之一，它定义了实例的水平移动速度(沿x轴)，单位为每一步像素。

source: iPhone5 with display size 640 x 1136)
zh_cn: iPhone5，屏幕尺寸640 x 1136)

source: iPhone6 with display size 1334 x 750
zh_cn: iPhone6，屏幕尺寸1334 x 750

source: if no text is stored it will return an empty string "".
zh_cn: 如果没有存储文本，它将返回一个空字符串 ""。

source: if the list contains more values after the given position, their position will be shifted up one to make room making the list larger by one.
zh_cn: 如果列表在给定位置后包含更多的值，它们的位置将上移一位，以腾出空间使列表大一位。

source: if the time line has been created dynamically using the timeline_add() function, the name returned will have the format "__newtimelineN" where "N" is the number of the time line (starting from 0).
zh_cn: 如果时间线是使用timeline_add()函数动态创建的，则返回的名称将采用"__newtimelineN"格式，其中"N"是时间线的编号(从0开始)。

source: if this time line was created in the GameMaker Asset Browser, please note that it is removed completely from the game and trying to call the indexed time line again after using this function will cause an error.
zh_cn: 如果此时间线是在GameMaker资源浏览器中创建的，注意，它将从游戏中完全删除，并且在通过此函数后试图再次调用索引时间线将会导致错误。

source: index of the path that is to be used by the function
zh_cn: 函数要使用的路径的索引

source: insert key
zh_cn: 插入键insert

source: it is the same value as can be found in the sprite editor for the collision mask properties.
zh_cn: 它与碰撞遮罩属性的精灵编辑器中的值相同。

source: it should be noted that a stopped time line is not reset, and so starting it again at a later time will start it from the exact moment that it was stopped at.
zh_cn: 应该注意的是，停止的时间线不会重置，因此在稍后的时间重新启动它将从它被停止的确切时刻开始。

source: keycode for the down arrow key
zh_cn: 向下箭头键的键码

source: keycode for the function keys F1 to F12
zh_cn: 功能键F1至F12的键码

source: keycode for the left arrow key
zh_cn: 左箭头键的键码

source: keycode for the right arrow key
zh_cn: 右箭头键的键码

source: keycode for the up arrow key
zh_cn: 向上箭头键的键码

source: keycode representing that any key is pressed
zh_cn: 代表任何键被按下的键码

source: keycode representing that no key is pressed
zh_cn: 代表没有按键的键码

source: left alt key
zh_cn: 左alt键

source: left control key
zh_cn: 左ctrl键

source: left shift key
zh_cn: 左shift键

source: method/function that you want to call
zh_cn: 要调用的方法/函数

source: multiply key on the numeric keypad
zh_cn: 数字键盘上的乘法键

source: normally you would want to do this in the Create Event of the instance with the skeletal animation as it only needs set once, and GameMaker will interpolate all further changes to the sprite using the animation sets in that instance.
zh_cn: 通常情况下你会希望在带有骨骼动画的实例的创建事件(Create Event)中这么做，因为它只需要设置一次，而GameMaker将使用该实例中的动画设置将所有进一步的更改插入到精灵中。

source: number keys on the numeric keypad
zh_cn: 数字键盘上的数字键

source: pagedown key
zh_cn: 下翻页键

source: pageup key
zh_cn: 上翻页键

source: pause/break key
zh_cn: 暂停/中断键(pause/break)

source: position values (x, y, z)
zh_cn: 位置值 (x, y, z)

source: printscreen/sysrq key
zh_cn: 截屏键(printscreen/sysrq)

source: radius of the circle
zh_cn: 圆的半径

source: returns the static struct for the given struct or function / script, returns undefined if no static struct is set.
zh_cn: 返回给定结构或函数/脚本的静态结构，如果未设置静态结构，则返回未定义的结构。

source: returns true if "struct" has "constructor_name" as part of its inheritance hierarchy
zh_cn: 如果“struct”的继承层次结构中包含“constructor_name”，则返回 true

source: right alt key
zh_cn: 右alt键

source: right control key
zh_cn: 右ctrl键

source: right shift key
zh_cn: 右shift键

source: sampler index
zh_cn: 取样器索引

source: sets the static struct on the given struct.
zh_cn: 在给定结构上设置静态结构。

source: space key
zh_cn: 空格键

source: speed is one of those properties and defines how many pixels the instance will move every step.
zh_cn: 速度是这些属性之一，它定义了实例每移动一步将移动多少像素。

source: start x position for the edge
zh_cn: 边缘的起始x位置

source: start y position for the edge
zh_cn: 边缘的起始y位置

source: subtract key on the numeric keypad
zh_cn: 数字键盘上的减法键

source: switch on (true) or off (false) the debug overlay.
zh_cn: 打开(true)或关闭(false)调试覆盖。

source: tab key
zh_cn: 制表键(tab)

source: tangent values
zh_cn: 正切值

source: the "angle" argument is the angle of rotation that the calling instance has (or will have) at the position to be checked, and the "obj" argument can be either a single instance id, and object index or the keywords all or other.
zh_cn: "angle"参数是调用实例在要检查的位置具有(或将具有)的旋转角度，"obj"参数可以是单个实例id、对象索引或关键字all或other。

source: the actual number of cpu steps per game step, use the fps_real variable.
zh_cn: 每个游戏步骤的实际cpu步骤数，使用fps_real变量。

source: the angular damping of the fixture, usually between 0 and 1
zh_cn: 夹具的角阻尼，通常在0到1之间

source: the blendweight of the input matrix (for skeletal animation, for example)
zh_cn: 输入矩阵的混合权重(例如，用于骨骼动画)

source: the damping of the fixture, usually between 0 and 1
zh_cn: 夹具的阻尼，通常在0和1之间

source: the density of the fixture calculated as kg/m²
zh_cn: 夹具的密度计算为kg/m²

source: the fixture that is to be bound
zh_cn: 要绑定的夹具

source: the fixture that is to be deleted from memory
zh_cn: 要从内存中删除的夹具

source: the following image illustrates how this variable relates to the rest of the positioning functions available through the Window Functions.
zh_cn: 下图说明了该变量与窗口函数中可用的其余定位函数的关系。

source: the friction of the fixture
zh_cn: 夹具的摩擦力

source: the function requires that you give the attachment a UNIQUE name (as a string) and then set the sprite_index and image_index to use, as well as the x and y origin (which can be different to that defined by the sprite in the sprite properties), and you can also set any transforms that you wish to be applied to the image when attached, as well as the colour to be blended with the image and it's alpha (transparency) value.
zh_cn: 此函数要求您为附件指定一个 唯一 的名称(作为字符串)，然后设置要使用的sprite_index和image_index，以及x和y原点(可以不同于sprite属性中sprite定义的原点)，并且您还可以设置附加时希望应用于图像的任何变换，以及要与图像混合的颜色及其alpha(透明度)值。

source: the function requires that you give the attachment a UNIQUE name (as a string) and then set the sprite_index and image_index to use, as well as the x and y origin (which can be different to that defined by the sprite in the sprite properties), and you can also set any transforms that you wish to be applied to the image when attached.
zh_cn: 此函数要求您为附件指定一个唯一的名称(作为字符串)，然后设置要使用的sprite_index和image_index，以及x和y原点(可以不同于sprite属性中sprite定义的原点)，并且您还可以设置附加时希望应用于图像的任何变换。

source: the function requires that you give the attachment a name (as a string) and then set the sprite_index and image_index to use, as well as the x and y origin (which can be different to that defined by the sprite in the sprite properties), and you can also set any transforms that you wish to be applied to the image when attached, as well as the colour to be blended with the image and it's alpha (transparency) value.
zh_cn: 此函数要求您为附件指定一个名称(作为字符串)，然后设置要使用的sprite_index和image_index，以及x和y原点(可以不同于sprite属性中sprite定义的原点)，并且您还可以设置附加时希望应用于图像的任何变换，以及要与图像混合的颜色及其alpha(透明度)值。

source: the function requires that you give the attachment a name (as a string) and then set the sprite_index and image_index to use, as well as the x and y origin (which can be different to that defined by the sprite in the sprite properties), and you can also set any transforms that you wish to be applied to the image when attached.
zh_cn: 此函数要求您为附件指定一个名称(作为字符串)，然后设置要使用的sprite_index和image_index，以及x和y原点(可以不同于sprite属性中sprite定义的原点)，并且您还可以设置附加时希望应用于图像的任何变换。

source: the function returns the index of this new time line which should be stored in a variable for use in all further function calls that involve this new time line.
zh_cn: 函数返回这条新时间线的索引，该索引应该存储在一个变量中，以便在涉及这条新时间线的所有后续函数调用中使用。

source: the group that this fixture is assigned to (either a positive value, 0, or a negative value)
zh_cn: 此fixture被分配给的组(可以是正值、0或负值)

source: the half height of the box
zh_cn: 盒子的半高

source: the half width of the box
zh_cn: 盒子的半宽

source: the id of the bound fixture
zh_cn: 绑定的夹具的id

source: the id of the data structure to check
zh_cn: 要检查的数据结构的id

source: the index of the fixture
zh_cn: 夹具的索引

source: the indicator of what can be done with the file.
zh_cn: 可以用该文件做什么的指示器。

source: the indices of the matrices to use (for skeletal animation, for example)
zh_cn: 要使用的矩阵的索引(例如，用于骨骼动画)

source: the iterations (per step) that the physics system will perform
zh_cn: 物理系统将执行的迭代次数(每步)

source: the key to check for
zh_cn: 要检查的键

source: the new density value to apply
zh_cn: 要应用的新密度值

source: the new friction value to apply
zh_cn: 要应用新摩擦值

source: the new restitution value to apply
zh_cn: 要应用的新恢复值

source: the number of times per second that the physics system updates
zh_cn: 物理系统每秒更新的次数

source: the offset along the x-axis
zh_cn: x轴的偏移量

source: the offset along the y-axis
zh_cn: y轴的偏移量

source: the second y coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的第二个y坐标

source: the target instance that is to receive the fixture (can be an instance id, an object id, other, or all)
zh_cn: 要接收夹具的目标实例(可以是实例id、对象id、other、all)

source: the tile-data to check
zh_cn: 要检查的图块数据

source: the tile-data to set
zh_cn: 要设置的图块数据

source: the type of asset should be one of the following constants:
zh_cn: 资源类型应该是下列常量之一:

source: the type of challenge to be issued - one of two constants given below.
zh_cn: 发出的挑战类型-下面给出的两个常量之一。

source: the x component of the force vector
zh_cn: 力矢量的x分量

source: the x component of the impulse vector
zh_cn: 脉冲向量的x分量

source: the x component of the impulse vector (relative to the xpos coordinate)
zh_cn: 脉冲向量的x分量(相对于xpos坐标)

source: the x position of the point (relative to the fixture origin for polygon shapes)
zh_cn: 点的x位置(相对于多边形的夹具原点)

source: the y component of the force vector
zh_cn: 力矢量的y分量

source: the y component of the impulse vector
zh_cn: 脉冲向量的y分量

source: the y component of the impulse vector (relative to the ypos coordinate)
zh_cn: 脉冲向量的y分量(相对于ypos坐标)

source: the y position of the point (relative to the fixture origin for polygon shapes)
zh_cn: 点的y位置(相对于多边形的夹具原点)

source: this buffer becomes read-only, meaning that should you need to change it, you would have to delete the whole buffer and re-create it.
zh_cn: 该缓冲区变为只读，这意味着如果您需要更改它，您必须删除整个缓冲区并重新创建它。

source: this check can be either precise or not, but for precise collisions to be enabled, the object or instance that you are checking for must also have precise collisions enabled for their sprite.
zh_cn: 该检查可以是精确的，也可以是不精确的，但是要启用精确碰撞，您正在检查的对象或实例也必须为其精灵启用精确碰撞。

source: this function does not open the file itself!
zh_cn: 此函数不会打开文件本身！

source: this function does not save the file itself!
zh_cn: 此函数不会保存文件本身！

source: this function will return the index of the path which should be stored in a variable and used as the reference for that path from then on.
zh_cn: 此函数将返回路径的索引，该索引应该存储在一个变量中，并从那时起用作该路径的引用。

source: this function will return the unique instance id of the object being collided, but if that is not needed it is slightly faster to use the function place_meeting().
zh_cn: 此函数将返回被碰撞对象的唯一实例id，但是如果不需要，使用函数place_meeting()会稍微快一些。

source: this is not an approximate length from point to point, but rather an exact length along the shape of the path, even when the path is smooth with a high curved precision.
zh_cn: 这不是从点到点的近似长度，而是沿着路径形状的精确长度，即使路径平滑且具有高弯曲精度。

source: this means that to clear a cell at a specific position in the room, we must change the x and y coordinates into cell coordinate dividing them by the resolution of the MP grid.
zh_cn: 这意味着，要清除房间中特定位置的单元格，我们必须将x和y坐标转换为单元格坐标，并将它们除以MP网格的分辨率。

source: true if landscape orientation is allowed, false otherwise
zh_cn: 如果允许横向，则为true，否则为false

source: true if portait orientation is allowed, false otherwise
zh_cn: 如果允许纵向，则为true，否则为false

source: use Coordinated Universal Time
zh_cn: 使用协调世界时

source: use the local time zone as set by the system
zh_cn: 请以系统设置的本地时区为准

source: vertex depth buffer value
zh_cn: 顶点深度缓冲值

source: vertex normal values (nx, ny, nz)
zh_cn: 顶点法线值 (nx, ny, nz)

source: vertical position of the cell to clear
zh_cn: 要清除的单元格的垂直位置

source: vspeed is one of the "built in" properties that all instances have and defines the vertical movement speed (along the y-axis) of the instance in pixels per step.
zh_cn: vspeed是所有实例都具有的"内置"属性之一，它定义了实例的垂直移动速度(沿y轴),单位为每步像素。

source: whether a fixture is a sensor (true) or not (false)
zh_cn: 夹具是否是传感器(true)或不(false)

source: whether a fixture is awake (true) or not (false)
zh_cn: 夹具是否处于唤醒状态(true)或不(false)

source: you can set these values to 1 to get a position anywhere in the room.
zh_cn: 您可以将这些值设置为1，以获得房间中任何位置的位置。
